app/controllers/api/v1/users_controller.rb

    def create
        user = User.find_or_create_by(username: params[:username], initials: params[:initials])
---
INSERT INTO "users" ("username", "initials", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "asfght4ertfreq3r"], ["initials", "fweqrq"], ["created_at", "2019-11-14 15:47:55.839165"], ["updated_at", "2019-11-14 15:47:55.839165"]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1 AND "users"."initials" = $2 LIMIT $3  [["username", "1"], ["initials", "1"], ["LIMIT", 1]]

    def update
        user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE (78) LIMIT $1  [["LIMIT", 1]]